[    
    {
        "id": 1,
        "name": "Statistics (one factor)",
        "description": "Statistical analysis of generic data table. Data processing (default filtering and log normalization) followed by downstream analysis: Statistics (fold change, t-tests/ANOVA, volcano plot), chemometrics (PCA, PLS-DA, OPLS-DA, sPLS-DA), clustering (k-means, SOM), and machine learning methods (SVM, random forests)",
        "input": "Feature table",
        "analysisGoal": "Significance analysis and pattern discovery",
        "analysisMethods": "Statistics (fold change, t-tests/ANOVA, volcano plot), chemometrics (PCA, PLS-DA, OPLS-DA, sPLS-DA), clustering (k-means, SOM), and machine learning methods (SVM, random forests)",
        "output": "Significant features and patterns together with graphical outputs such as heatmaps, volcano plots, VIP plots, scores and loadings.",
        "other": "NA",
        "module": "stat",
        "type": "default",
        "image": "stat.png",
        "filename": "workflow_stat.json"
    }
    ,
    {
        "id": 2,
        "name": "Statistics (multifactor)",
        "description": "Statistical analysis of data with multiple metadata groups. Data and metadata processing (default filtering and log normalization) followed by metadata visualization, interactive PCA Visualization, heatmap clustering, linear modeling, correlation analysis, multi-factor ANOVA, ASCA, Random Forest",
        "input": "Feature table and a metadata table",
        "analysisGoal": "Explore your metadata, relationship between your features and metadata, multivariate analysis",
        "analysisMethods": "Metadata visualization, interactive PCA Visualization, heatmap clustering, linear modeling, correlation analysis, multi-factor ANOVA, ASCA, Random Forest",
        "output": "Various graphical outputs, statistical analysis result tables.",
        "other": "NA",
        "module": "mf",
        "type": "default",
        "image": "mf.png",
        "filename": "workflow_mf.json"
    },
    {
        "id": 3,
        "name": "Biomarker Analysis",
        "description": "Biomarker analysis. Data and metadata processing (default filtering and log normalization) followed with Univariate ROC analysis, multivariate ROC based on PLS-DA.",
        "input": "Feature abundance table with binary response",
        "analysisGoal": "Identify and validate potential biomarkers associated with specific phenotypes or conditions",
        "analysisMethods": "Univariate ROC analysis, multivariate ROC based on PLS-DA, SVM and random forests, manual biomarker selection.",
        "output": "Ranked biomarker tables, ROC curve plots, various performance measures.",
        "other": "NA",
        "module": "roc",
        "type": "default",
        "image": "roc.png",
        "filename": "workflow_roc.json"
    }

]
